posts/2015-01-13-immersed-in-love.org
#+date: <2015-01-13>
#+filetags: prayer
#+title: Immersed in Love

Mitch Randall’s sermon Sunday was beautiful, the thought of being immersed in God’s love brought to mind both the final scene of Bergman’s /Through A Glass Darkly/ and the end of the "Cana of Galilee" chapter in /The Brothers Karamazov/.

Father,

I remember wearing a white robe,\\
when I felt the water\\
slipping over my face.

Even through the water,\\
I could hear the voice say,\\
"Buried with him in baptism,\\
and raised to walk in new life."

But it seems that the well of grace\\
has since run dry,\\
and the springs of faith\\
have ceased to flow.

Nothing is left\\
but a dry, dusty heart\\
and an old and bitter soul.

But a heart can be cleansed,\\
and a soul can be restored,\\
indeed, all things become new\\
when immersed in the ocean of your love.

/Amen/


#+begin_tagline
Tagged: [[file:../tags/prayer.org][Prayer]]
#+end_tagline
