docs/posts/2015-01-13-immersed-in-love.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 30, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Immersed in Love</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Immersed in Love</h1>
<p class="subtitle" role="doc-subtitle">Jan 13, 2015</p>
</header><p>
Mitch Randall’s sermon Sunday was beautiful, the thought of being immersed in God’s love brought to mind both the final scene of Bergman’s <i>Through A Glass Darkly</i> and the end of the &ldquo;Cana of Galilee&rdquo; chapter in <i>The Brothers Karamazov</i>.
</p>

<p>
Father,
</p>

<p>
I remember wearing a white robe,<br>
when I felt the water<br>
slipping over my face.
</p>

<p>
Even through the water,<br>
I could hear the voice say,<br>
&ldquo;Buried with him in baptism,<br>
and raised to walk in new life.&rdquo;
</p>

<p>
But it seems that the well of grace<br>
has since run dry,<br>
and the springs of faith<br>
have ceased to flow.
</p>

<p>
Nothing is left<br>
but a dry, dusty heart<br>
and an old and bitter soul.
</p>

<p>
But a heart can be cleansed,<br>
and a soul can be restored,<br>
indeed, all things become new<br>
when immersed in the ocean of your love.
</p>

<p>
<i>Amen</i>
</p>


<div class="tagline" id="org2eddd07">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 30, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
